InformationRegisters/ОсновныеСпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСпецификацииНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпецификацияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыЗаполненияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЦенамНоменклатуры</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦенамНоменклатурыКонтрагентов</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуреИЦенамКонтрагентов</Name>
					<Comment>(Упр)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРозничнымЦенам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродажнымЦенам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ХарактерЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ХарактерЗатрат</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БракВПроизводстве</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенияВоВнеоборотныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаСбыт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщепроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеРасходы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперационныеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноЗаготовительныеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НоменклатурныеГруппы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеВПроизводстве</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеПроизводством/Ext/Module.bsl
// Процедура устанавливает видимость ячеек для ввода аналитики в зависимости от указанной статьи затрат.
//
Процедура НастроитьВидимостьЯчеекАналитикиЗатрат(СчетЗатрат = Неопределено, ОформлениеСтроки, ОтражатьВБухгалтерскомУчете) Экспорт
																														   
	Если НЕ ОформлениеСтроки.Ячейки.Найти("Аналитика") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.Аналитика.Видимость    = Ложь;
	КонецЕсли;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("ВидАналитики") = Неопределено Тогда
		ОформлениеСтроки.Ячейки.ВидАналитики.Видимость = Ложь;
	КонецЕсли;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("ВидСубконто3") = Неопределено Тогда

		Если ЗначениеЗаполнено(СчетЗатрат) Тогда

			КоличествоСубконто = СчетЗатрат.ВидыСубконто.Количество();

			Если КоличествоСубконто > 0 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто1.УстановитьТекст(СчетЗатрат.ВидыСубконто.Получить(0).ВидСубконто);
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто1.УстановитьТекст("");
			КонецЕсли;

			Если КоличествоСубконто > 1 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто2.УстановитьТекст(СчетЗатрат.ВидыСубконто.Получить(1).ВидСубконто);
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто2.УстановитьТекст("");
			КонецЕсли;

			Если КоличествоСубконто > 2 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто3.УстановитьТекст(СчетЗатрат.ВидыСубконто.Получить(2).ВидСубконто);
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто3.УстановитьТекст("");
			КонецЕсли;

		Иначе
			ОформлениеСтроки.Ячейки.ВидСубконто1.УстановитьТекст("");
			ОформлениеСтроки.Ячейки.ВидСубконто2.УстановитьТекст("");
			ОформлениеСтроки.Ячейки.ВидСубконто3.УстановитьТекст("");
		КонецЕсли;

	КонецЕсли;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("Субконто1") = Неопределено Тогда

		ОформлениеСтроки.Ячейки.Субконто1.ТолькоПросмотр = ОформлениеСтроки.Ячейки.Субконто1.ТолькоПросмотр;
		ОформлениеСтроки.Ячейки.Субконто2.ТолькоПросмотр = ОформлениеСтроки.Ячейки.Субконто2.ТолькоПросмотр;
		ОформлениеСтроки.Ячейки.Субконто3.ТолькоПросмотр = ОформлениеСтроки.Ячейки.Субконто3.ТолькоПросмотр;

	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьЯчеекАналитикиЗатрат()

// Процедура удаляет из строки имен реквизитов, проверяемых на заполненность
// реквизиты, которые зависят от типа учета документа
//
// Параметры:
//		ДокОбъект - проверяемый документ
//		СтрокаРекв   - Строка с именами реквизитов, которые надо проверять на заполненность
//      УпрРеквизиты - строка, с именами реквизитов имеющих смысл
// 					   только в случае если документ отражается в упр.учете
//      БухРеквизиты - строка, с именами реквизитов имеющих смысл
// 					   только в случае если документ отражается в регл.(бух.) учете
//      НалРеквизиты - строка, с именами реквизитов имеющих смысл
// 					   только в случае если документ отражается в регл.(нал.) учете
//		ИмяТабЧасти  - имя проверяемой табл. части документа
//
Процедура НепроверятьРеквизитыПоТипуУчета(ДокОбъект, СтрокаРекв, Знач УпрРеквизиты, Знач БухРеквизиты, Знач НалРеквизиты, ИмяТабЧасти = "", СтруктураШапкиДокумента = Неопределено) Экспорт

	Стр = СтрЗаменить(СтрокаРекв, " ", "");
	СтруктРекв = Новый Структура(Стр);
	СтрокаРекв = "";

	// Убрать пробелы и символы перевода строки
	УпрРекв = СтрЗаменить(УпрРеквизиты, " ", "");
	УпрРекв = СтрЗаменить(УпрРекв, Символы.ПС,  "");
	УпрРекв = "," + СтрЗаменить(УпрРекв, Символы.Таб, "") + ",";
	
	БухРекв = СтрЗаменить(БухРеквизиты, " ", "");
	БухРекв = СтрЗаменить(БухРекв, Символы.ПС,  "");
	БухРекв = "," + СтрЗаменить(БухРекв, Символы.Таб, "") + ",";

	НалРекв = СтрЗаменить(НалРеквизиты, " ", "");
	НалРекв = СтрЗаменить(НалРекв, Символы.ПС,  "");
	НалРекв = "," + СтрЗаменить(НалРекв, Символы.Таб, "") + ",";

	Если СтруктураШапкиДокумента = Неопределено Тогда
		УпрУчет = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВУправленческомУчете", ДокОбъект.Метаданные()),ДокОбъект.ОтражатьВУправленческомУчете,Ложь);
        БухУчет = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете",  ДокОбъект.Метаданные()),ДокОбъект.ОтражатьВБухгалтерскомУчете,Ложь);
		НалУчет = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("ОтражатьВБухгалтерскомУчете",  ДокОбъект.Метаданные()),ДокОбъект.ОтражатьВБухгалтерскомУчете,Ложь);
	Иначе
		УпрУчет = СтруктураШапкиДокумента.ОтражатьВУправленческомУчете;
		БухУчет = СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете;
		НалУчет = СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете;
	КонецЕсли;

	// Исключим из списка проверяемых реквизитов, те которые относятся к конкретному
	// виду учета и этот вид учета выключен
	Для Каждого Рекв Из СтруктРекв Цикл

		ИмяРекв = ?(ПустаяСтрока(ИмяТабЧасти), "", ИмяТабЧасти + ".") + Рекв.Ключ;

		Если Не УпрУчет И Найти(УпрРекв, "," + ИмяРекв + ",") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не БухУчет И Найти(БухРекв, "," + ИмяРекв + ",") > 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Не НалУчет И Найти(НалРекв, "," + ИмяРекв + ",") > 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаРекв = ?(ПустаяСтрока(СтрокаРекв), "", СтрокаРекв + ", ") + Рекв.Ключ;

	КонецЦикла;

КонецПроцедуры // НепроверятьРеквизитыПоТипуУчета()

// Функция определяет основную спецификациию для заданной
// номенклатуры на определенный момент.
//
Функция ОпределитьСпецификациюПоУмолчанию(Знач Номенклатура, Знач Характеристика, Знач Момент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Момент) Тогда // используем текущую дату
		Момент = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли; 
	
	
	Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Номенклатура, Характеристика);
	
	Спецификация = РегистрыСведений.ОсновныеСпецификацииНоменклатуры.ПолучитьПоследнее(Момент,Отбор).СпецификацияНоменклатуры;
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		
		// не удалось определить с точностью до характеристики
		Отбор.Вставить("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Спецификация = РегистрыСведений.ОсновныеСпецификацииНоменклатуры.ПолучитьПоследнее(Момент, Отбор).СпецификацияНоменклатуры;
		
	КонецЕсли; 
	
	Возврат Спецификация;

КонецФункции // ОпределитьСпецификациюПоУмолчанию()

// Функция производит расчет сырья, необходимый для производства готовой
// продукции, указанной в документе - основание
Функция РассчитатьРасходСырьяПоСпецификации(ОснованиеСсылка, ДокументаОснованиеТЧ = "Продукция") Экспорт
	
	ДокументаОснование = ОснованиеСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СпецификацииНоменклатурыИсходныеКомплектующие.Номенклатура КАК Номенклатура,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументОснование.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ДокументОснование.Подразделение КАК Подразделение,
		|	ДокументОснование.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|   ЗНАЧЕНИЕ(Справочник.Качество.Новый) КАК Качество, 
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпецификацииНоменклатурыИсходныеКомплектующие.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА (СпецификацииНоменклатуры.Количество * СпецификацииНоменклатуры.ЕдиницаИзмерения.Коэффициент) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументОснование.КоличествоПродукции * СпецификацииНоменклатурыИсходныеКомплектующие.Количество / (СпецификацииНоменклатуры.Количество * СпецификацииНоменклатуры.ЕдиницаИзмерения.Коэффициент)
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДокументОснованиеТаблица.Спецификация КАК Спецификация,
		|		ДокументОснованиеТаблица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|		ДокументОснованиеШапка.Подразделение КАК Подразделение,
		|		ДокументОснованиеШапка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ДокументОснованиеТаблица.Коэффициент КАК Коэффициент, 
		|		ДокументОснованиеТаблица.Количество КАК КоличествоПродукции
		|	ИЗ
		|		Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ДокументОснованиеТаблица
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПроизводстваЗаСмену КАК ДокументОснованиеШапка
		|			ПО ДокументОснованиеТаблица.Ссылка = ДокументОснованиеШапка.Ссылка
		|	ГДЕ
		|		ДокументОснованиеТаблица.Ссылка = &Ссылка
		|		И ДокументОснованиеТаблица.Спецификация <> &Спецификация) КАК ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ИсходныеКомплектующие КАК СпецификацииНоменклатурыИсходныеКомплектующие
		|			ПО СпецификацииНоменклатурыИсходныеКомплектующие.Ссылка = СпецификацииНоменклатуры.Ссылка
		|		ПО ДокументОснование.Спецификация = СпецификацииНоменклатуры.Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОснованиеСсылка);
		Запрос.УстановитьПараметр("Спецификация", Справочники.СпецификацииНоменклатуры.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтчетПроизводстваЗаСмену", ДокументаОснование);
		Если ДокументаОснование = "РеализацияУслугПоПереработке" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснованиеТаблица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснование.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснование.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснованиеШапка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснование.Подразделение КАК Подразделение,", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснованиеШапка.Подразделение КАК Подразделение,", "");
			ДокументаОснованиеТЧ = "Услуги";
		КонецЕсли;	
		Если ДокументаОснование = "АктОбОказанииПроизводственныхУслуг" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДокументОснованиеТаблица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,", "ДокументОснованиеШапка.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,");
			ДокументаОснованиеТЧ = "Услуги";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Продукция", ДокументаОснованиеТЧ);
		
		Если ДокументаОснованиеТЧ = "Услуги" Тогда
		
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДокументОснованиеТаблица.Коэффициент", "1");
		
		КонецЕсли;
		
		Возврат Запрос.Выполнить();
		
КонецФункции



Функция СформироватьНаименованиеНоменклатурнойПозиции(Характеристика, Серия, Заказ, Качество) Экспорт
	
	ЕстьХарактеристика = ЗначениеЗаполнено(Характеристика);
	ЕстьСерия          = ЗначениеЗаполнено(Серия);
	ЕстьКачество       = (ЗначениеЗаполнено(Качество)) И (Качество <> Справочники.Качество.Новый);
	ЕстьЗаказ          = ЗначениеЗаполнено(Заказ);
	
	Текст = "";
	Текст = Текст + ?(ЕстьХарактеристика, "хар.: " + Характеристика,"");
	Текст = Текст + ?(ЕстьСерия, ?(Текст <> "", ", ", "") + "сер.: " + Серия,"");
	Текст = Текст + ?(ЕстьКачество, ?(Текст <> "", ", ", "") + НСтр("ru='кач.: ';uk='кач.: '") + Качество, ?(Текст <> "", ", ", "") + НСтр("ru='кач.: ';uk='кач.: '") + Справочники.Качество.Новый);
	Текст = Текст + ?(ЕстьЗаказ, ?(Текст <> "", ", ", "") + НСтр("ru='заказ: ';uk='замовлення: '") + Заказ,"");
	
	Возврат Текст;
КонецФункции 

Функция ВыводНаименованияВыпуска(Наименование, ВыводитьЕдиницыИзмерения = Истина, Характеристика = Неопределено, Серия = Неопределено, Заказ = Неопределено, Качество = Неопределено) Экспорт
	
	Если ТипЗнч(Наименование) = Тип("СправочникСсылка.Номенклатура") Тогда
		Рез = Наименование.НаименованиеПолное + ?(ВыводитьЕдиницыИзмерения, " (" + Наименование.БазоваяЕдиницаИзмерения + ")", "");
		Если НЕ Наименование.Услуга Тогда
			НаименованиеНомПозиции = СформироватьНаименованиеНоменклатурнойПозиции(Характеристика, Серия, Заказ, Качество);	
		Иначе
			НаименованиеНомПозиции = "";
		КонецЕсли; 
		Если НаименованиеНомПозиции <> "" Тогда
			Рез = Рез + ", " + НаименованиеНомПозиции;
		КонецЕсли; 
		Возврат Рез;
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат НСтр("ru='Услуги производственного характера';uk='Послуги виробничого характеру'");
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Возврат НСтр("ru='Услуги, оказанные для подразделения ';uk='Послуги, зроблені для підрозділу '") + Наименование.Наименование;
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.Подразделения") Тогда
		Возврат НСтр("ru='Услуги, оказанные для подразделения ';uk='Послуги, зроблені для підрозділу '") + Наименование.Наименование;
    Иначе
		Возврат Наименование;
		
	КонецЕсли;
		
КонецФункции


Функция ВыводНоменклатурыЗатрат(Наименование, ВыводитьЕдиницыИзмерения = Истина, Характеристика = Неопределено, Серия = Неопределено, Заказ = Неопределено, Качество = Неопределено) Экспорт
	
	Если ТипЗнч(Наименование) = Тип("СправочникСсылка.Номенклатура") Тогда
		Рез = Наименование.НаименованиеПолное + ?(ВыводитьЕдиницыИзмерения, " (" + Наименование.БазоваяЕдиницаИзмерения + ")", "");
		Если НЕ Наименование.Услуга Тогда
			НаименованиеНомПозиции = СформироватьНаименованиеНоменклатурнойПозиции(Характеристика, Серия, Заказ, Качество);
		Иначе
			НаименованиеНомПозиции = "";
		КонецЕсли; 	
		Если НаименованиеНомПозиции <> "" Тогда
			Рез = Рез + ", " + НаименованиеНомПозиции;
		КонецЕсли; 
		Возврат Рез;
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Возврат НСтр("ru='Услуги производственного характера';uk='Послуги виробничого характеру'");
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Возврат НСтр("ru='Услуги, оказанные подразделением ';uk='Послуги, надані підрозділом '") + Наименование.Наименование;
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.Подразделения") Тогда
		Возврат НСтр("ru='Услуги, оказанные подразделением ';uk='Послуги, надані підрозділом '") + Наименование.Наименование;
	ИначеЕсли ТипЗнч(Наименование) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат НСтр("ru='Услуги, оказанные контрагентом ';uk='Послуги, надані контрагентом '") + Наименование.Наименование;
    Иначе
		Возврат Наименование;
	КонецЕсли;
		
КонецФункции


// Функция производит пересчет суммы в валюте упр. учета в валюту регл. учета.
//
Функция РассчитатьСуммуРегл(СуммаУпр, ВалютаРегламентированногоУчета, ВалютаУправленческогоУчета, Дата) Экспорт
	
	ВалютаРегл = ВалютаРегламентированногоУчета;
	ВалютаУпр = ВалютаУправленческогоУчета;
	
	КурсВал   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРегл, Дата);
	КурсРегл  = КурсВал.Курс;
	КратРегл  = КурсВал.Кратность;
	
	КурсВал   = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУпр, Дата);
	КурсУпр   = КурсВал.Курс;
	КратУпр   = КурсВал.Кратность;
	
	Если КурсРегл = 0 Тогда
		Сообщить(НСтр("ru='Не задан курс валюты ""';uk='Не заданий курс валюти ""'") + ВалютаУправленческогоУчета + НСтр("ru='"" регламентированного учета!';uk='"" регламентованого обліку!'"), СтатусСообщения.Внимание);
		Возврат 0;
	КонецЕсли;
	
	Если КурсУпр = 0 Тогда
		Сообщить(НСтр("ru='Не задан курс валюты ""';uk='Не заданий курс валюти ""'") + ВалютаУправленческогоУчета + НСтр("ru='"" управленческого учета!';uk='"" управлінського обліку!'"), СтатусСообщения.Внимание);
		Возврат 0;
	КонецЕсли;

	СуммаРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаУпр, ВалютаУпр, ВалютаРегл, КурсУпр, КурсРегл, КратУпр, КратРегл);
	
	Возврат СуммаРегл;
	
КонецФункции // РассчитатьСуммуРегл()

// Рассчитывает плановую себестоимость в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти           - строка табличной части документа,
//  ДокументОбъект                 - объект редактируемого документа.
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
Процедура РассчитатьПлановуюСебестоимостьВСтрокеТабЧастиПроизводство(СтрокаТабличнойЧасти, ДокументОбъект, ВалютаРегламентированногоУчета, ПересчитатьНалоги = Истина, ЗаполнитьСебестоимостьУпр = Ложь, ВалютаУправленческогоУчета = Неопределено) Экспорт

	ИмяТабличнойЧасти = ОбщегоНазначения.ПолучитьИмяТабличнойЧастиПоСсылкеНаСтроку(СтрокаТабличнойЧасти);

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		ХарактеристикаНоменклатуры = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры;
	Иначе
		ХарактеристикаНоменклатуры = Неопределено;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЕдиницаИзмерения", МетаданныеДокумента, ИмяТабличнойЧасти) Тогда
		ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
	Иначе
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка(); // для услуг
	КонецЕсли;
	

	ТипЦенПлановойСебестоимостиНоменклатуры = Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		 ВалютаДокумента = ДокументОбъект.ВалютаДокумента;
		 КурсДокумента = ЗаполнениеДокументов.КурсДокумента(ДокументОбъект, ВалютаРегламентированногоУчета);
		 КратностьДокумента = ЗаполнениеДокументов.КратностьДокумента(ДокументОбъект, ВалютаРегламентированногоУчета);
	Иначе
		 ВалютаДокумента = ВалютаРегламентированногоУчета;
		 КурсДокумента = 1;
		 КратностьДокумента = 1;
	КонецЕсли; 

	ПлановаяСебестоимость = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, ХарактеристикаНоменклатуры,
	                                             ТипЦенПлановойСебестоимостиНоменклатуры, 
	                                             ДокументОбъект.Дата, 
	                                             ЕдиницаИзмерения, 
	                                             ВалютаДокумента,
	                                             КурсДокумента,
	                                             КратностьДокумента);

	Если ПересчитатьНалоги Тогда
		ПлановаяСебестоимость = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(ПлановаяСебестоимость,
		                                               Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
		                                               ТипЦенПлановойСебестоимостиНоменклатуры.ЦенаВключаетНДС,
		                                               ДокументОбъект.УчитыватьНДС,
		                                               ДокументОбъект.СуммаВключаетНДС,
		                                               УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	КонецЕсли;												  

	СтрокаТабличнойЧасти.ПлановаяСтоимость = ПлановаяСебестоимость;
	
	Если ЗаполнитьСебестоимостьУпр И ДокументОбъект.ОтражатьВУправленческомУчете Тогда
		
		ПлановаяСебестоимостьУпр = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, ХарактеристикаНоменклатуры,
		                                             ТипЦенПлановойСебестоимостиНоменклатуры, 
		                                             ДокументОбъект.Дата, 
		                                             ЕдиницаИзмерения,
		                                             ВалютаУправленческогоУчета,
		                                             0,
		                                             1);
													 
		СтрокаТабличнойЧасти.ПлановаяСтоимостьУпр = ПлановаяСебестоимостьУпр;
		
	КонецЕсли;

КонецПроцедуры // РассчитатьПлановуюСебестоимостьВСтрокеТабЧастиПроизводство()

// Функция проверяет является ли статья затрат производственной
//
// Параметры:
//  СтатьяЗатрат  - Счатья затрат, для которой определяется отнесение к производственным расходам
//
// Возвращаемое значение:
//  Истина - статья затрат относится к производственным расходам.
//
Функция ПроверитьСтатьюЗатратНаПроизводственныеРасходы(СтатьяЗатрат) Экспорт

	Возврат НЕ (ЗначениеЗаполнено(СтатьяЗатрат) И СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие);

КонецФункции // ПроверитьСтатьюЗатратНаПроизводственныеРасходы()

// Функция возвращает счет учета для указанной статьи затрат
//
// Параметры:
//  Подразделение - Подразделение, для которого определяются счет
//  СтатьяЗатрат  - Счатья затрат, для которой определяются счет
//
// Возвращаемое значение:
//  Счет
//
Функция ПолучитьСчетУчетаСтатьиЗатрат(Подразделение, СтатьяЗатрат) Экспорт
	
	ПустоеПодразделение = НЕ ЗначениеЗаполнено(Подразделение);
	ПустаяСтатьяЗатрат  = НЕ ЗначениеЗаполнено(СтатьяЗатрат);
	ПланСчетовБух       = ПланыСчетов.Хозрасчетный;
	Счет                = ПланСчетовБух.ПустаяСсылка();

	Если ПустаяСтатьяЗатрат И Не ПустоеПодразделение Тогда
		Счет = ПланСчетовБух.ОсновноеПроизводство;

	ИначеЕсли Не ПустаяСтатьяЗатрат Тогда
		Если СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы Тогда
			Счет = ПланСчетовБух.ОбщепроизводственныеРасходы;
		ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.АдминистративныеРасходы Тогда
			Счет = ПланСчетовБух.АдминистративныеРасходы;
		ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве Тогда
			Счет = ПланСчетовБух.БракВПроизводстве;
		ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт Тогда
			Счет = ПланСчетовБух.РасходыНаСбыт;
		ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы Тогда
			Счет = ПланСчетовБух.ИзготовлениеОсновныхСредств;
		ИначеЕсли СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы Тогда
			Счет = ПланСчетовБух.ТранспортноЗаготовительныеРасходыМатериалы;
		Иначе
			Если СтатьяЗатрат.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы Тогда
				Счет = ПланСчетовБух.ОсновноеПроизводство;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтатьяЗатрат.ХарактерЗатрат) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В статье затрат ""';uk='У статті витрат ""'")+СтатьяЗатрат+НСтр("ru='"" не указан характер затрат';uk='"" не вказаний характер витрат'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Счет;

КонецФункции // ПолучитьСчетаУчетаСтатьиЗатрат()

// Функция возвращает значение характера затрат, соответствующего счету затрат.
//
// Параметры
//  СчетЗатрат - ПланСчетовСсылка - счет затрат, по которому определяется характер затрат.
//  СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - статья затрат для уточнения характера затрат.
//
// Возвращаемое значение:
//   Строка – характер затрат, соответствующий счету затрат.
//
Функция ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат, СтатьяЗатрат = Неопределено, Дата = Неопределено) Экспорт	
	// Проверка счета затрат.
	Если НЕ ЗначениеЗаполнено(СчетЗатрат) Тогда
		ПравильныйСчетЗатрат = Ложь;
	ИначеЕсли ТипЗнч(СчетЗатрат) <> Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Счет затрат ';uk='Рахунок витрат '") + СчетЗатрат + НСтр("ru=' не соответствует плану счетов: ""';uk=' не відповідає плану рахунків: ""'") + "Хозрасчетный" + НСтр("ru='""."
"Функция <ПолучитьХарактерЗатратПоСчетуЗатрат>';uk='""."
"Функція <ПолучитьХарактерЗатратПоСчетуЗатрат>'"));
		ПравильныйСчетЗатрат = Ложь;
	// Если все проверки пройдены, значит передан правильный счет затрат.
	Иначе
		ПравильныйСчетЗатрат = Истина;
	КонецЕсли;
	
	Если ПравильныйСчетЗатрат Тогда
		
		Если СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.Производство
			  ИЛИ (СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Производство)
			  	И НЕ (СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт))
			  	И НЕ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства)) Тогда
			  
			ХарактерЗатрат   = "Производство";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства) Тогда
			  
			  ХарактерЗатрат = "Производство";
			  
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.БракВПроизводстве
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.БракВПроизводстве) Тогда
		
			ХарактерЗатрат = "Производство";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы) Тогда
		
			  Если ЗначениеЗаполнено(Дата)
				  И Дата < глЗначениеПеременной("ДатаНачалаРаспределенияОПЗвНУ") Тогда
				  // В начале, Налоговый кодекс относил ОПЗ на затраты периода, а не включал в себестоимость продукции
				  // Закон 3609 в п.43 это изменил. 
				  // дата вступления в силу изменений 01.08.2011: см. п.2 переходных положений
				  //           2. Норми підпунктів 40 - 53, 55 - 59 ... цього Закону застосовуються з першого числа звітного 
				  //           (податкового) місяця, у якому набирає чинності цей Закон.
				  ХарактерЗатрат = "Затраты";
		  	  Иначе	  
				   // распределяемые в НУ
				   ХарактерЗатрат = "ОПЗ";  
			  КонецЕсли;
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы) Тогда
			ХарактерЗатрат = "Затраты";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов) Тогда
			ХарактерЗатрат = "РБП";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтПервоначальногоПризнанияИИзмененияСтоимостиАктивовПоСправедливойСтоимости
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыНаИсследованияИРазработки
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойИностраннойВалюты
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СомнительныеИБезнадежныеДолги
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтОперационнойКурсовойРазницы
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтОбесцениванияЗапасов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.НедостачиИПотериОтПорчиЦенностей
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ПризнанныеШтрафыПениНеустойки
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа) Тогда
			  
			  ХарактерЗатрат = "Затраты";
			  
		 ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.РасходыНаСбыт
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаСбыт) Тогда
			  
			  ХарактерЗатрат = "Затраты";
			  
		 ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ФинансовыеЗатраты
              ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ПотериОтУчастияВКапитале
              ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыДеятельности
              ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.НалогНаПрибыль
              ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЧрезвычайныеЗатраты
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ФинансовыеЗатраты)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ПотериОтУчастияВКапитале)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыДеятельности)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.НалогНаПрибыль)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ЧрезвычайныеЗатраты) Тогда
			  
			  ХарактерЗатрат = "Затраты";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.КапитальноеСтроительство
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеОсновныхСредств
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеДругихНеоборотныхМатериальныхАктивов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеНематериальныхАктивов
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеНематериальныхАктивов)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.КапитальноеСтроительство)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеОсновныхСредств)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеДругихНеоборотныхМатериальныхАктивов)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт) Тогда
			  
			ХарактерЗатрат = "Строительство";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.МатериальныеЗатраты
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.Амортизация
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.МатериальныеЗатраты)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ЗатратыНаОплатуТруда)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОтчисленияНаСоциальныеМероприятия)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Амортизация)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыПоЭлементам) Тогда
			
			ХарактерЗатрат = "Затраты";
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы
			ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары 
		    ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет  
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы)
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары) 
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет) Тогда
			
			ХарактерЗатрат = "ТЗР";     
			
		Иначе
			ХарактерЗатрат = "Прочие";
		КонецЕсли;
	Иначе
		ХарактерЗатрат = "Прочие";
	КонецЕсли;
	
	Возврат ХарактерЗатрат;
	
КонецФункции // ПолучитьХарактерЗатратПоСчетуЗатрат()

// Функция возвращает значение характера затрат, соответствующего счету затрат.
//
// Параметры
//  СчетЗатрат - ПланСчетовСсылка - счет затрат, по которому определяется характер затрат.
//  СтатьяЗатрат - СправочникСсылка.СтатьиЗатрат - статья затрат для уточнения характера затрат.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ХарактерЗатрат – характер затрат, соответствующий счету затрат.
//
Функция ПолучитьХарактерЗатратПоСчетуЗатратПриПоступлении(СчетЗатрат, СтатьяЗатрат) Экспорт	
	
	// Проверка счета затрат.
	Если НЕ ЗначениеЗаполнено(СчетЗатрат) Тогда
		ПравильныйСчетЗатрат = Ложь;
	ИначеЕсли ТипЗнч(СчетЗатрат) <> Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Счет затрат ';uk='Рахунок витрат '") + СчетЗатрат + НСтр("ru=' не соответствует плану счетов: ""';uk=' не відповідає плану рахунків: ""'") + "Хозрасчетный" + НСтр("ru='""."
"Функция <ПолучитьХарактерЗатратПоСчетуЗатратПриПоступлении>';uk='""."
"Функція <ПолучитьХарактерЗатратПоСчетуЗатратПриПоступлении>'"));
		ПравильныйСчетЗатрат = Ложь;
	// Если все проверки пройдены, значит передан правильный счет затрат.
	Иначе
		ПравильныйСчетЗатрат = Истина;
	КонецЕсли;
	
	Если ПравильныйСчетЗатрат Тогда
		
		Если СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.Производство
			  ИЛИ (СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Производство) 
			  И НЕ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт) 
			  И НЕ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства)) Тогда
			  
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы;
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства) Тогда
			  
			Если НЕ ЗначениеЗаполнено(СтатьяЗатрат) Тогда
				ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы;
			Иначе
				ХарактерЗатрат = СтатьяЗатрат.ХарактерЗатрат;
			КонецЕсли;
			
			  
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.БракВПроизводстве
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.БракВПроизводстве) Тогда
		
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве;
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы) Тогда
		
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы;
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АдминистративныеРасходы) Тогда
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.АдминистративныеРасходы;
		
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтПервоначальногоПризнанияИИзмененияСтоимостиАктивовПоСправедливойСтоимости
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыНаИсследованияИРазработки
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованнойИностраннойВалюты
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.СомнительныеИБезнадежныеДолги
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтОперационнойКурсовойРазницы
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ЗатратыОтОбесцениванияЗапасов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.НедостачиИПотериОтПорчиЦенностей
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ПризнанныеШтрафыПениНеустойки
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа) Тогда
			  
			  ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы;
			  
		 ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.РасходыНаСбыт
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасходыНаСбыт) Тогда
			  
			  ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт;
			
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.КапитальноеСтроительство
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеОсновныхСредств
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеДругихНеоборотныхМатериальныхАктивов
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт
			  ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ИзготовлениеНематериальныхАктивов
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеНематериальныхАктивов)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.КапитальноеСтроительство)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеОсновныхСредств)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ИзготовлениеДругихНеоборотныхМатериальныхАктивов)
			  ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОбслуживаниеИРемонт) Тогда
			  
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы;
			
		// По счету 8 класса характер затраты по счету определить не можем
		// Поэтому для всех счетов 8-го класса возвращаем характер, указанный в статье затрат
		ИначеЕсли СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ЗатратыПоЭлементам) Тогда
			Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
				ХарактерЗатрат = СтатьяЗатрат.ХарактерЗатрат;
			Иначе
				ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие;
			КонецЕсли;
		ИначеЕсли СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы
			ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары 
		    ИЛИ СчетЗатрат = ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет  
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыМатериалы)
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТовары) 
			ИЛИ СчетЗатрат.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ТранспортноЗаготовительныеРасходыТоварыСуммовойУчет) Тогда
			
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.ТранспортноЗаготовительныеРасходы;     			
		Иначе
			ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие;
		КонецЕсли;
	Иначе
		ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ХарактерЗатрат;
	
КонецФункции // ПолучитьХарактерЗатратПоСчетуЗатрат()

#Если Клиент Тогда
	
// Процедура устанавливает видимость ячеек для ввода аналитики в зависимости от указанной статьи затрат
Процедура УстановитьВидимостьЯчеекАналитикиЗатрат(ХарактерЗатрат, СчетЗатрат = НЕОПРЕДЕЛЕНО, ОформлениеСтроки, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Дата = Неопределено) Экспорт
	Если Дата = Неопределено Тогда
		Дата = глЗначениеПеременной("ДатаНачалаРаспределенияОПЗвНУ");
	КонецЕсли;
																																									  
	ХарактерЗатратБУ = ПолучитьХарактерЗатратПоСчетуЗатратПриПоступлении(СчетЗатрат, Неопределено);
	
	ПустойХарактерЗатрат    = НЕ ЗначениеЗаполнено(ХарактерЗатрат);
	
	ПрочиеРасходы           = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	ПрочиеРасходыБУ         = (ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	ПроизводственныеРасходы = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы)
								ИЛИ (ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.ПроизводственныеРасходы);
	БракВПроизводстве       = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.БракВПроизводстве)
								ИЛИ (ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.БракВПроизводстве);
	Строительство           = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы)
								ИЛИ (ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы);
								
	ОбщеПроизводственныеРасходы = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы)
								ИЛИ (ХарактерЗатратБУ = Перечисления.ХарактерЗатрат.ОбщепроизводственныеРасходы);
								
	ЗатратыНаСбыт = (ХарактерЗатрат = Перечисления.ХарактерЗатрат.РасходыНаСбыт);

	НоменклатурнаяГруппа = (Не ПустойХарактерЗатрат) И НЕ ((ПрочиеРасходы И ПрочиеРасходыБУ) ИЛИ Строительство);
	НоменклатурнаяГруппа = НоменклатурнаяГруппа И НЕ ОбщеПроизводственныеРасходы;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("Аналитика") = НЕОПРЕДЕЛЕНО Тогда
		ОформлениеСтроки.Ячейки.Аналитика.Видимость = Ложь;
	КонецЕсли;

	Если ОформлениеСтроки.Ячейки.НоменклатурнаяГруппа.Видимость <> НоменклатурнаяГруппа Тогда
		ОформлениеСтроки.Ячейки.НоменклатурнаяГруппа.Видимость      = НоменклатурнаяГруппа;
		ОформлениеСтроки.Ячейки.НоменклатурнаяГруппа.ТолькоПросмотр = НЕ НоменклатурнаяГруппа;
	КонецЕсли;
	
	Если НЕ ОформлениеСтроки.Ячейки.Найти("ВидАналитики") = НЕОПРЕДЕЛЕНО Тогда
		ОформлениеСтроки.Ячейки.ВидАналитики.Видимость          = НЕ ((ПрочиеРасходы И ПрочиеРасходыБУ) ИЛИ ПустойХарактерЗатрат);
		ОформлениеСтроки.Ячейки.ВидАналитики.ОтображатьТекст    = Истина;

		Если Строительство Тогда
			ОформлениеСтроки.Ячейки.ВидАналитики.Текст = "Объект строительства";
		ИначеЕсли ОбщеПроизводственныеРасходы Тогда
			ОформлениеСтроки.Ячейки.ВидАналитики.Текст = "";
		Иначе	
			ОформлениеСтроки.Ячейки.ВидАналитики.Текст = "Номенклатурная группа";
		КонецЕсли;
	КонецЕсли;
	
	Если ПрочиеРасходыБУ И ЗначениеЗаполнено(СчетЗатрат) Тогда
		КоличествоСубконто = СчетЗатрат.ВидыСубконто.Количество();
	Иначе
		КоличествоСубконто = 0;
	КонецЕсли;
	
	Если ОформлениеСтроки.Ячейки.Найти("Заказ") <> НЕОПРЕДЕЛЕНО Тогда
		// ввод заказов имеет смысл только для характера затрат - затраты на сбыт
		ОформлениеСтроки.Ячейки.Заказ.ТолькоПросмотр = НЕ ЗатратыНаСбыт;
	КонецЕсли;
	
	
	
	Если НЕ ОформлениеСтроки.Ячейки.Найти("ВидСубконто3") = НЕОПРЕДЕЛЕНО Тогда

		ОформлениеСтроки.Ячейки.ВидСубконто1.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
		ОформлениеСтроки.Ячейки.ВидСубконто2.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
		ОформлениеСтроки.Ячейки.ВидСубконто3.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
		
		ОформлениеСтроки.Ячейки.ВидСубконто1.ОтображатьТекст = Истина;
		ОформлениеСтроки.Ячейки.ВидСубконто2.ОтображатьТекст = Истина;
		ОформлениеСтроки.Ячейки.ВидСубконто3.ОтображатьТекст = Истина;

		Если ПрочиеРасходыБУ И ЗначениеЗаполнено(СчетЗатрат) Тогда

			Если КоличествоСубконто > 0 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто1.Текст = СчетЗатрат.ВидыСубконто.Получить(0).ВидСубконто;
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто1.Текст = "";
			КонецЕсли;

			Если КоличествоСубконто > 1 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто2.Текст = СчетЗатрат.ВидыСубконто.Получить(1).ВидСубконто;
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто2.Текст = "";
			КонецЕсли;

			Если КоличествоСубконто > 2 Тогда
				ОформлениеСтроки.Ячейки.ВидСубконто3.Текст = СчетЗатрат.ВидыСубконто.Получить(2).ВидСубконто;
			Иначе
				ОформлениеСтроки.Ячейки.ВидСубконто3.Текст = "";
			КонецЕсли;

		Иначе

			ОформлениеСтроки.Ячейки.ВидСубконто1.Текст = "";
			ОформлениеСтроки.Ячейки.ВидСубконто2.Текст = "";
			ОформлениеСтроки.Ячейки.ВидСубконто3.Текст = "";

		КонецЕсли;

	КонецЕсли;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("ОбъектСтроительства") = НЕОПРЕДЕЛЕНО Тогда
		ОформлениеСтроки.Ячейки.ОбъектСтроительства.Видимость = Строительство;
		ОформлениеСтроки.Ячейки.ОбъектСтроительства.ТолькоПросмотр = НЕ Строительство;
	КонецЕсли;

	Если НЕ ОформлениеСтроки.Ячейки.Найти("Субконто1") = НЕОПРЕДЕЛЕНО Тогда

		ОформлениеСтроки.Ячейки.Субконто1.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
		ОформлениеСтроки.Ячейки.Субконто2.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
		ОформлениеСтроки.Ячейки.Субконто3.Видимость = ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете;
          
		ОформлениеСтроки.Ячейки.Субконто1.ТолькоПросмотр = (КоличествоСубконто < 1) ИЛИ НЕ (ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете);
		ОформлениеСтроки.Ячейки.Субконто2.ТолькоПросмотр = (КоличествоСубконто < 2) ИЛИ НЕ (ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете);
		ОформлениеСтроки.Ячейки.Субконто3.ТолькоПросмотр = (КоличествоСубконто < 3) ИЛИ НЕ (ПрочиеРасходыБУ И ОтражатьВБухгалтерскомУчете);

	КонецЕсли;

	ХарактерЗатратНУ = ПолучитьХарактерЗатратПоСчетуЗатрат(СчетЗатрат, Неопределено, Дата);
																					 
	Если  ОформлениеСтроки.Ячейки.Найти("НалоговоеНазначениеДоходовИЗатрат") <> Неопределено Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеДоходовИЗатрат.ТолькоПросмотр  = НЕ (ХарактерЗатратНУ = "Затраты");
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеДоходовИЗатрат.ОтображатьТекст = (ХарактерЗатратНУ = "Затраты");
	КонецЕсли;
	
	Если  ОформлениеСтроки.Ячейки.Найти("ПоставкаОсновныхФондов") <> Неопределено Тогда
		ОформлениеСтроки.Ячейки.ПоставкаОсновныхФондов.ОтображатьФлажок  = Истина;
		ОформлениеСтроки.Ячейки.ПоставкаОсновныхФондов.Флажок = (ХарактерЗатратНУ = "Строительство");
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьЯчеекАналитикиЗатрат()

Процедура УстановитьСубконтоПодразделениеОрганизацииВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов, Организация) Экспорт

	ИмяРеквизитаСчет = СтруктураНаименованийРеквизитов.СчетЗатрат;
	ИмяРеквизита = СтруктураНаименованийРеквизитов.ПодразделениеОрганизации;
	
	ХарактерЗатрат = СтрокаТабличнойЧасти[СтруктураНаименованийРеквизитов.СтатьяЗатрат].ХарактерЗатрат;
	Очистить = ОтражатьВБухгалтерскомУчете;
	Очистить = Очистить И ЗначениеЗаполнено(ХарактерЗатрат);
	Очистить = Очистить И НЕ (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	Счет = СтрокаТабличнойЧасти[ИмяРеквизитаСчет];
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Если ТипСубк.СодержитТип(Тип("СправочникСсылка.ПодразделенияОрганизаций")) Тогда
			Если Очистить Тогда
				СтрокаТабличнойЧасти["Субконто" + Сч] = Справочники.ПодразделенияОрганизаций.ПустаяСсылка(); 
			Иначе
				СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита];	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // УстановитьСубконтоПодразделениеОрганизацииВТабЧасти()

Процедура УстановитьСубконтоСтатьяЗатратВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов) Экспорт

	ИмяРеквизитаСчет = СтруктураНаименованийРеквизитов.СчетЗатрат;
	ИмяРеквизита = СтруктураНаименованийРеквизитов.СтатьяЗатрат;
	
	ХарактерЗатрат = СтрокаТабличнойЧасти[СтруктураНаименованийРеквизитов.СтатьяЗатрат].ХарактерЗатрат;
	Очистить = ОтражатьВБухгалтерскомУчете;
	Очистить = Очистить И ЗначениеЗаполнено(ХарактерЗатрат);
	Очистить = Очистить И НЕ (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	Счет = СтрокаТабличнойЧасти[ИмяРеквизитаСчет];
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Если ТипСубк.СодержитТип(Тип("СправочникСсылка.СтатьиЗатрат")) Тогда
			Если Очистить Тогда
				СтрокаТабличнойЧасти["Субконто" + Сч] = Справочники.СтатьиЗатрат.ПустаяСсылка(); 
			Иначе
				Заполняем = Ложь;
				Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти["Субконто" + Сч]) Тогда
					// пустые заполняем
					Заполняем = Истина;
				ИначеЕсли СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита] Тогда
					// субконто уже и так заполнено этим значением
					Заполняем = Ложь;
				Иначе	
					Если Вопрос(НСтр("ru='Заменить значение Субконто';uk='Замінити значення Субконто'") + Сч + НСтр("ru=' (статья затрат) ""';uk=' (стаття витрат) ""'")
						+ СтрокаТабличнойЧасти["Субконто" + Сч] + НСтр("ru='"" на ""';uk='"" на ""'")
						+ СтрокаТабличнойЧасти[ИмяРеквизита] + """ ?",
						РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						Заполняем = Истина;
					КонецЕсли;
				КонецЕсли; 
				Если Заполняем Тогда
					СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита];	
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // УстановитьСубконтоСтатьяЗатратВТабЧасти()

Процедура УстановитьСубконтоНоменклатурнаяГруппаВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов) Экспорт

	ИмяРеквизитаСчет = СтруктураНаименованийРеквизитов.СчетЗатрат;
	ИмяРеквизита = СтруктураНаименованийРеквизитов.НоменклатурнаяГруппа;
	
	ХарактерЗатрат = СтрокаТабличнойЧасти[СтруктураНаименованийРеквизитов.СтатьяЗатрат].ХарактерЗатрат;
	Очистить = ОтражатьВБухгалтерскомУчете;
	Очистить = Очистить И ЗначениеЗаполнено(ХарактерЗатрат);
	Очистить = Очистить И НЕ (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	
	Счет = СтрокаТабличнойЧасти[ИмяРеквизитаСчет];
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Если ТипСубк.СодержитТип(Тип("СправочникСсылка.НоменклатурныеГруппы")) Тогда
			Если Очистить Тогда
				СтрокаТабличнойЧасти["Субконто" + Сч] = Справочники.НоменклатурныеГруппы.ПустаяСсылка(); 
			Иначе
				СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита];
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // УстановитьСубконтоПодразделениеОрганизацииВТабЧасти()

Процедура УстановитьСубконтоОбъектСтроительстваВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов) Экспорт

	ИмяРеквизитаСчет = СтруктураНаименованийРеквизитов.СчетЗатрат;
	ИмяРеквизита = СтруктураНаименованийРеквизитов.ОбъектСтроительства;
	
	ХарактерЗатрат = СтрокаТабличнойЧасти[СтруктураНаименованийРеквизитов.СтатьяЗатрат].ХарактерЗатрат;
	Очистить = ОтражатьВБухгалтерскомУчете;
	Очистить = Очистить И ЗначениеЗаполнено(ХарактерЗатрат);
	Очистить = Очистить И НЕ (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	Счет = СтрокаТабличнойЧасти[ИмяРеквизитаСчет];
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Если ТипСубк.СодержитТип(Тип("СправочникСсылка.ОбъектыСтроительства")) Тогда
			Если Очистить Тогда
				СтрокаТабличнойЧасти["Субконто" + Сч] = Справочники.ОбъектыСтроительства.ПустаяСсылка(); 
			Иначе
				СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита];
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // УстановитьСубконтоПодразделениеОрганизацииВТабЧасти()

Процедура УстановитьСубконтоНалоговоеНазначениеВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов) Экспорт

	ИмяРеквизитаСчет = СтруктураНаименованийРеквизитов.СчетЗатрат;
	ИмяРеквизита = СтруктураНаименованийРеквизитов.НалоговоеНазначение;
	
	ХарактерЗатрат = СтрокаТабличнойЧасти[СтруктураНаименованийРеквизитов.СтатьяЗатрат].ХарактерЗатрат;
	Очистить = ОтражатьВБухгалтерскомУчете;
	Очистить = Очистить И ЗначениеЗаполнено(ХарактерЗатрат);
	Очистить = Очистить И НЕ (ХарактерЗатрат = Перечисления.ХарактерЗатрат.Прочие ИЛИ ХарактерЗатрат = Перечисления.ХарактерЗатрат.ПрочиеОперационныеРасходы);
	
	
	Счет = СтрокаТабличнойЧасти[ИмяРеквизитаСчет];
	ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		ТипСубк = Счет.ВидыСубконто[Сч - 1].ВидСубконто.ТипЗначения;
		Если ТипСубк.СодержитТип(Тип("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат")) Тогда
			Если Очистить Тогда
				СтрокаТабличнойЧасти["Субконто" + Сч] = Справочники.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка(); 
			Иначе
				СтрокаТабличнойЧасти["Субконто" + Сч] = СтрокаТабличнойЧасти[ИмяРеквизита];
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // УстановитьСубконтоНалоговоеНазначениеВТабЧасти()


// Процедура установки значений субконто 
//
Процедура ПриВыбореСчетаЗатратВТабличномПоле(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов, Организация) Экспорт
	
	УстановитьСубконтоПодразделениеОрганизацииВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов, Организация);
	УстановитьСубконтоСтатьяЗатратВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов);
	УстановитьСубконтоНоменклатурнаяГруппаВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов);
	УстановитьСубконтоОбъектСтроительстваВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов);
	УстановитьСубконтоНалоговоеНазначениеВТабЧасти(ОтражатьВБухгалтерскомУчете, СтрокаТабличнойЧасти, СтруктураНаименованийРеквизитов);
	
КонецПроцедуры // ПриВыбореСчетаЗатратВТабличномПоле

// Процедура заполняет значение счета затрат в табличной части документа в зависимости от статьи затрат.
//
Процедура ЗаполнитьСчетЗатратВСтрокеТабличногоПоля(СтрокаТабличнойЧасти, ПодразделениеОрганизации, СтатьяЗатрат, ИмяСчетаЗатрат = "СчетЗатрат", ЗаполнятьБУ = Истина) Экспорт
	
	Если ЗаполнятьБУ = Истина Тогда
		СчетУчета = УправлениеПроизводством.ПолучитьСчетУчетаСтатьиЗатрат(ПодразделениеОрганизации, СтатьяЗатрат);
		СтрокаТабличнойЧасти[ИмяСчетаЗатрат] = СчетУчета;
	ИначеЕсли ЗаполнятьБУ = Ложь Тогда
		СтрокаТабличнойЧасти[ИмяСчетаЗатрат] = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСчетЗатратВСтрокеТабличногоПоля()


#КонецЕсли
